emacs/Emacs.org
#+TITLE: Emacs config
#+AUTHOR: Cristi Ctin

* early-init.el
:PROPERTIES:
:header-args: :tangle ./early-init.el
:END:

#+begin_src emacs-lisp
;;; early-init.el --- Early Init File -*- lexical-binding: t -*-
;;
;; THIS FILE IS TANGLED, DON'T EDIT

;; Performance improvements
(setq gc-cons-threshold most-positive-fixnum)

;; Disable some visual elements early
(add-to-list 'default-frame-alist '(border-width . 0))
(add-to-list 'default-frame-alist '(tool-bar-lines . 0))
(add-to-list 'default-frame-alist '(menu-bar-lines . 0))
(add-to-list 'default-frame-alist '(vertical-scroll-bars . nil))
(add-to-list 'default-frame-alist '(horizontal-scroll-bars . nil))
;; Disable all WM decorations (maybe)
;; (add-to-list 'default-frame-alist '(undecorated . t))

;; Ignore X resources
(advice-add #'x-apply-session-resources :override #'ignore)

;; Don't init `package.el', using `straight.el' instead
(setq package-enable-at-startup nil)

;; Inhibits loading the default library
(setq inhibit-default-init t)

;; Font compacting can be very expensive
(setq inhibit-compacting-font-caches t)

;; Inhibit resizing frame
(setq frame-inhibit-implied-resize t)

;; Frame sizes can increase/decrease by one pixel
(setq frame-resize-pixelwise t)

;; Disable startup features
(setq inhibit-startup-screen t
      inhibit-startup-message t
      initial-scratch-message ";; scratch\n")

;; Auto-compile options
(setq load-prefer-newer t)
(setq auto-compile-mode-line-counter t)
(setq auto-compile-update-autoloads t)

;; THIS FILE IS TANGLED, DON'T EDIT
;;
;;; early-init.el ends here
#+end_src

* init.el
:PROPERTIES:
:header-args: :tangle ./init.el
:END:

** Basic variables

#+begin_src emacs-lisp
;;; init.el -*- lexical-binding: t; -*-
;;
;; THIS FILE IS TANGLED, DON'T EDIT

(setq user-full-name "Cristi Ctin"
      user-mail-address "john@doe.com")

(defconst my-emacs-d (file-name-as-directory user-emacs-directory)
  "My emacs.d folder.")

(defconst my-lisp-dir (concat my-emacs-d "lisp")
  "My lisp folder.")

;; Disable novice, all commands work normally
(setq-default disabled-command-function nil)

;; UTF encoding everywhere
(set-keyboard-coding-system  'utf-8)
(set-selection-coding-system 'utf-8)
(set-terminal-coding-system  'utf-8)
(prefer-coding-system 'utf-8)

;; No auto-save, backups or lockfiles
(setq auto-save-default nil
      backup-by-copying t
      create-lockfiles nil
      delete-old-versions t
      make-backup-files nil
      backup-inhibited t)
#+end_src

** GUI features

#+begin_src emacs-lisp
;; Supress GUI features
(when (featurep 'tooltip)    (tooltip-mode 0))
(when (featurep 'tool-bar)   (tool-bar-mode 0))
(when (featurep 'menu-bar)   (menu-bar-mode 0))
(when (featurep 'scroll-bar) (scroll-bar-mode 0))
(setq use-dialog-box nil)
(setq use-file-dialog nil)

;; Space on the left side, for git gutter
(set-fringe-mode '(5 . 0))

;; Set window title
(setq-default frame-title-format '("%F - %b"))
#+end_src

** Fonts

#+begin_src emacs-lisp
(setq my-font "JetBrains Mono Light")
(set-face-attribute 'default nil :family my-font :height 110)
(set-face-attribute 'fixed-pitch nil :family my-font :height 110)
(set-face-attribute 'variable-pitch nil :family "Inter Light" :height 110)
(set-frame-font my-font nil t)

;; Display symbols and emojis
(set-fontset-font t 'unicode (font-spec :family "Noto Sans Symbols") nil 'prepend)
(set-fontset-font t 'symbol (font-spec :family "Noto Color Emoji") nil 'prepend)
#+end_src

** Buffers

Nicer buffer naming, for files with identical names.
Other small aesthetic improvements.

#+begin_src emacs-lisp
(setq uniquify-buffer-name-style 'reverse
      uniquify-separator " • "
      uniquify-ignore-buffers-re "^\\*")

;; Show a symbol at the start and end of the buffer
(setq indicate-buffer-boundaries '((top . left) (bottom . left)))
;; Hide cursor in other windows
(setq-default cursor-in-non-selected-windows nil)

;; Don't stretch the cursor to fit wide characters
(setq-default x-stretch-cursor nil)
#+end_src

** Scrolling

#+begin_src emacs-lisp
;; Performant rapid scrolling
(setq-default fast-but-imprecise-scrolling t
              mouse-wheel-progressive-speed nil
              mouse-wheel-scroll-amount '(2 ((shift) . hscroll)))

;; More scroll settings
(setq scroll-margin 1
      scroll-conservatively 0
      auto-window-vscroll nil)

;; Disable bidirectional writing
(setq bidi-inhibit-bpa t)
(setq-default bidi-display-reordering 'left-to-right
              bidi-paragraph-direction 'left-to-right)
#+end_src

** Kill ring

#+begin_src emacs-lisp
;; Reduce bloat from kill-ring
(setq kill-do-not-save-duplicates t)

;; Max len of kill-ring before old elements are thrown away
(setq kill-ring-max 100)
  #+end_src

** Editing

#+begin_src emacs-lisp
;; Spaces vs tabs
(setq-default indent-tabs-mode nil
              tab-always-indent nil
              tab-width 4)

(setq electric-pair-pairs '((?\{ . ?\})
                            (?\( . ?\))
                            (?\[ . ?\])
                            (?\" . ?\")
                            ))

(add-hook 'after-init-hook
          (lambda ()
            ;; Visualize matching parens
            (show-paren-mode t)
            ;; Auto-match parentheses
            (electric-pair-mode t)
            ))
#+end_src

** Packages

Install packages with straight.el and use-package.el.

#+begin_src emacs-lisp
;; Enable/ disable debug
(setq init-file-debug nil)

(setq package-enable-at-startup nil
      straight-use-package-by-default t
      straight-check-for-modifications '(check-on-save)
      straight-vc-git-default-clone-depth 1
      straight-vc-git-default-protocol 'https)

;; straight bootstrap code
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; use-package initialization
(if init-file-debug
    (setq use-package-verbose t
          use-package-expand-minimally nil
          use-package-compute-statistics t
          debug-on-error t)
  (setq use-package-verbose nil
        use-package-expand-minimally t))

;; straight integration with use-package
(straight-use-package 'use-package)
(eval-when-compile (require 'use-package))

;; Useful macro
(defmacro use-feature (name &rest args)
  "Like `use-package' but with straight and ensure disabled.
NAME and ARGS are in `use-package'."
  (declare (indent defun))
  `(use-package ,name
     :straight nil
     :ensure nil
     ,@args))
#+end_src

** Async lib

Asynchronous processing lib.

#+begin_src emacs-lisp
(use-package async
  :demand t
  :config
  (dired-async-mode t)
  (async-bytecomp-package-mode t))
#+end_src

** Theme

#+begin_src emacs-lisp
(use-package doom-themes
  :init
  (setq doom-theme 'doom-sourcerer
        doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  :config
  (load-theme doom-theme t)
  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Corrects (and improves) org-mode's native fontification
  (doom-themes-org-config))

;; (use-package modus-themes
;;   :init
;;   (setq modus-themes-slanted-constructs t
;;         modus-themes-bold-constructs t
;;         modus-themes-fringes 'subtle
;;         modus-themes-no-mixed-fonts t
;;         modus-themes-scale-headings t
;;         modus-themes-subtle-line-numbers t)
;;   (setq modus-themes-mode-line 'borderless-3d)
;;   (setq modus-themes-org-blocks 'tinted-gray)
;;   ;; Load the theme files before enabling a theme
;;   (modus-themes-load-themes)
;;   :custom
;;   (modus-themes-operandi-color-overrides
;;    '((bg-main . "#FAFAFA")
;;      (fg-main . "#101010")
;;      (fg-window-divider-inner . "#FAFAFA")))
;;   (modus-themes-vivendi-color-overrides
;;    '((bg-main . "#101010")
;;      (fg-main . "#FAFAFA")
;;      (fg-window-divider-inner . "#101010")))
;;   :config
;;   (modus-themes-load-operandi)
;;   ;; (modus-themes-load-vivendi)
;;   :bind ("<f5>" . modus-themes-toggle))

;; (setq modus-themes-vivendi-color-overrides nil)
;; (setq modus-themes-vivendi-color-overrides
;;       '((bg-main . "#282828") (fg-main . "#fdf4c1")
;;         (bg-dim . "#32302f") (fg-dim . "#f4e8ba")
;;         (bg-alt . "#3c3836") (fg-alt . "#ebdbb2")
;;         (bg-hl-line . "#191628")
;;         (bg-active . "#282e46")
;;         (bg-inactive . "#1a1e39")
;;         (bg-region . "#393a53")
;;         (bg-header . "#202037")
;;         (bg-tab-bar . "#262b41")
;;         (bg-tab-active . "#120f18")
;;         (bg-tab-inactive . "#3a3a5a")
;;         (fg-unfocused . "#9a9aab")))
;; (load-theme 'modus-vivendi t)
#+end_src

** Files

#+begin_src emacs-lisp
;; Resolve symlinks when opening files
(use-feature files
  :init
  (setq require-final-newline t
        find-file-visit-truename t
        find-file-suppress-same-file-warnings t))

;; Builtin dired config
(use-feature dired
  :init
  ;; Always delete and copy recursively
  (setq dired-recursive-deletes 'top
        dired-recursive-copies 'always
        dired-dwim-target t
        ;; Ask if destination dirs should get created when copying/removing
        dired-create-destination-dirs 'ask
        ;; Human readable units
        dired-listing-switches "-alh -v --group-directories-first")
  :config
  (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)
  (define-key dired-mode-map (kbd "^") (lambda () (find-alternate-file ".."))))

(use-feature dired-x)

;; Colourful dired
(use-package diredfl
  :after dired
  :hook (dired-mode . diredfl-mode))
#+end_src

** Terminal

#+begin_src emacs-lisp
;; Use zsh as default term shell
(setq-default explicit-shell-file-name "zsh")

(use-package vterm
  :defer t
  :commands (vterm vterm-other-window)
  :bind
  (:map vterm-mode-map
        ("C-c C-c" . vterm-send-C-c))
  :config
  (evil-set-initial-state 'vterm-mode 'emacs))
#+end_src

** Editing

#+begin_src emacs-lisp
;; Enable visual-line, line and column almost everywhere
;;
(use-feature simple
  :custom
  (fill-column 100)
  (display-line-numbers-grow-only t)
  (display-line-numbers-type 'absolute)
  (display-line-numbers-widen t)
  (display-line-numbers-width 3)
  :hook
  (prog-mode . visual-line-mode)
  (text-mode . visual-line-mode)
  (prog-mode . display-line-numbers-mode)
  (text-mode . display-line-numbers-mode)
  (prog-mode . column-number-mode)
  (text-mode . column-number-mode))

;; Highlight space-like characters
;;
(use-feature whitespace
  :custom
  (whitespace-style '(face tabs empty trailing))
  :hook
  (text-mode . whitespace-mode)
  (prog-mode . whitespace-mode)
  :config
  ;; Trim whitespaces on save
  (add-hook 'before-save-hook 'delete-trailing-whitespace))

;; Highlight the current line
;;
(use-feature hl-line
  :hook
  (dired-mode . hl-line-mode)
  (prog-mode . hl-line-mode)
  (text-mode . hl-line-mode)
  :custom
  (hl-line-sticky-flag nil))

;; Automatically refresh the buffer when the file changes
;; Not enabled yet
;;
;; (use-feature autorevert
;;   :init
;;   ;; Only rely on the OS notification mechanism
;;   (setq auto-revert-avoid-polling t)
;;   :config
;;   (global-auto-revert-mode t))
#+end_src

** EVIL 😈

#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-respect-visual-line-mode t
        evil-kill-on-visual-paste nil
        evil-shift-width 2
        evil-undo-system 'undo-tree
        evil-kbd-macro-suppress-motion-error t
        evil-move-cursor-back nil
        evil-split-window-below  t  ;; move cursor below after split
        evil-vsplit-window-right t  ;; move cursor right after split
        evil-want-fine-undo   t     ;; remember changes in insert mode
        evil-want-integration t     ;; load evil-integration
        evil-want-Y-yank-to-eol t
        evil-want-keybinding nil)
  :config
  (evil-define-key 'normal 'global "zx" #'kill-current-buffer)
  ;; (define-key evil-normal-state-map [escape] 'keyboard-quit)
  (evil-mode t))

(use-package evil-collection
  :after evil
  :custom
  (evil-collection-mode-list '(dired
                               flycheck
                               apropos
                               help
                               helpful
                               info
                               magit
                               man
                               simple
                               ))
  :config
  (evil-collection-init))

;; Will re-use these keys
(with-eval-after-load 'evil-maps
  (define-key evil-motion-state-map (kbd "SPC") nil)
  (define-key evil-motion-state-map (kbd "RET") nil))

(use-package undo-tree
  :hook (after-init . global-undo-tree-mode)
  :init
  (setq undo-tree-visualizer-diff t
        undo-tree-visualizer-timestamps t))

;; Select and edit matches interactively
;;
(use-package evil-multiedit
  :after evil
  :config
  ;; Match the word under cursor (i.e. make it an edit region)
  ;; Consecutive presses will incrementally add the next unmatched match
  (define-key evil-normal-state-map (kbd "M-d") 'evil-multiedit-match-and-next)
  ;; Match selected region
  (define-key evil-visual-state-map (kbd "M-d") 'evil-multiedit-match-and-next)
  ;; Insert marker at point
  (define-key evil-insert-state-map (kbd "M-d") 'evil-multiedit-toggle-marker-here)
  ;; Same as M-d but in reverse
  (define-key evil-normal-state-map (kbd "M-D") 'evil-multiedit-match-and-prev)
  (define-key evil-visual-state-map (kbd "M-D") 'evil-multiedit-match-and-prev)
  ;; For moving between edit regions
  (define-key evil-multiedit-state-map (kbd "C-n") 'evil-multiedit-next)
  (define-key evil-multiedit-state-map (kbd "C-p") 'evil-multiedit-prev)
  (define-key evil-multiedit-insert-state-map (kbd "C-n") 'evil-multiedit-next)
  (define-key evil-multiedit-insert-state-map (kbd "C-p") 'evil-multiedit-prev))

(use-package evil-surround
  :after evil
  :config
  (global-evil-surround-mode t))

(use-package evil-commentary
  :after evil
  :config
  (evil-commentary-mode t))

(use-package expand-region
  :after evil
  :bind ("C-=" . er/expand-region))

;; Pretty eye candy 🍬
(use-package evil-goggles
  :after evil
  :config
  (evil-goggles-mode)
  (evil-goggles-use-diff-faces))
#+end_src

